SokhengDin/esp-mqtt-telegram/esp-app/sdkconfig.defaults
# ESP32-C6 Target Configuration
CONFIG_IDF_TARGET_ESP32C6=y
CONFIG_IDF_TARGET="esp32c6"

# WiFi Configuration
CONFIG_ESP_WIFI_SSID=""
CONFIG_ESP_WIFI_PASSWORD=""
CONFIG_ESP_MAXIMUM_RETRY=5

# MQTT Configuration
CONFIG_MQTT_BROKER_URI=""
CONFIG_MQTT_USERNAME=""
CONFIG_MQTT_PASSWORD=""

# FreeRTOS Configuration for ESP32-C6
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1
CONFIG_FREERTOS_ASSERT_ON_UNTESTED_FUNCTION=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW=2
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# Main task stack size (larger for ESP32-C6)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Task watchdog configuration - increased timeout
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y

# Heap configuration for ESP32-C6
CONFIG_HEAP_CORRUPTION_DETECTION=y
CONFIG_HEAP_TRACING_DEST_TRACING=y

# ESP32-C6 specific memory settings
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=y

# WiFi for ESP32-C6
CONFIG_ESP_WIFI_AUTH_WPA2_PSK=y
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y

# LWIP
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=y

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Partition Table
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# ESP32-C6 GPIO configuration
CONFIG_SOC_GPIO_VALID_GPIO_MASK=0x3FFFFF
CONFIG_SOC_GPIO_VALID_DIGITAL_IO_PAD_MASK=0x3FFFFF

# System configuration to prevent crashes
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_5=y

# Brownout Detector Configuration - Disable to prevent false triggers during PHY init
CONFIG_ESP_BROWNOUT_DET=n

# Power Management - More aggressive settings
CONFIG_ESP32_DEFAULT_CPU_FREQ_80=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=80

# PHY and RF Configuration - Reduce power consumption during initialization
CONFIG_ESP_PHY_REDUCE_TX_POWER=y
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=8
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=y
CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION=y
CONFIG_ESP_PHY_MAX_TX_POWER=8

# PHY Calibration optimization - avoid full calibration
CONFIG_ESP_PHY_RF_CAL_PARTIAL=y
CONFIG_ESP_PHY_CALIBRATION_MODE_PARTIAL=y

# Force minimal calibration mode
CONFIG_ESP_PHY_CALIBRATION_MODE=0

# Additional PHY power optimizations
CONFIG_ESP_PHY_ENABLE_USB=n
CONFIG_ESP_PHY_RF_CAL_NONE=y

# WiFi Power Management - More aggressive settings
CONFIG_ESP32_WIFI_IRAM_OPT=n
CONFIG_ESP32_WIFI_RX_IRAM_OPT=n
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=8
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=2
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n

# Additional power optimizations for ESP32-C6
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y

# Enable power management features
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_PM_USE_RTC_TIMER_REF=y
CONFIG_ESP_PM_TRACE=y

# Reduce system clock during WiFi operations
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y

# Memory optimizations to reduce power
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=n

# Disable unnecessary features to save power
CONFIG_ESP_COREDUMP_ENABLE=n
CONFIG_ESP_ERR_TO_NAME_LOOKUP=n

# Power management component dependencies
CONFIG_ESP_TIMER_PROFILING=y
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096

# ESP32-C6 specific power management
CONFIG_ESP32C6_DEFAULT_CPU_FREQ_160=n
CONFIG_ESP32C6_DEFAULT_CPU_FREQ_80=y
CONFIG_ESP32C6_DEFAULT_CPU_FREQ_MHZ=80 